major_job_mapping = {
    "경영ㆍ경제": [
        "022 경영ㆍ인사 전문가",
        "023 회계ㆍ세무ㆍ감정 전문가",
        "024 광고ㆍ조사ㆍ상품기획ㆍ행사기획 전문가",
        "026 경영지원 사무원",
        "027 회계ㆍ경리 사무원",
        "028 무역ㆍ운송ㆍ생산ㆍ품질 사무원",
        "031 금융ㆍ보험 전문가",
        "032 금융ㆍ보험 사무원",
        "033 금융ㆍ보험 영업원",
        "611 부동산 컨설턴트 및 중개인",
        "612 영업원 및 상품중개인"
    ],

    "사회과학": [
        "021 정부ㆍ공공 행정 전문가",
        "022 경영ㆍ인사 전문가",
        "024 광고ㆍ조사ㆍ상품기획ㆍ행사기획 전문가",
        "025 정부ㆍ공공 행정 사무원",
        "026 경영지원 사무원",
        "110 인문ㆍ사회과학 연구원",
        "211 대학교수 및 강사",
        "212 학교 교사",
        "214 문리ㆍ기술ㆍ예능 강사",
        "231 사회복지사 및 상담사",
        "240 경찰관, 소방관 및 교도관",
        "412 기자 및 언론 전문가"
    ],

    "유아교육": [
        "213 유치원 교사",
        "214 문리ㆍ기술ㆍ예능 강사",
        "215 장학관 및 기타 교육 종사자",
        "232 보육교사 및 기타 사회복지 종사자",
        "550 돌봄 서비스 종사자"
    ],

    "교통ㆍ운송": [
        "015 영업ㆍ판매ㆍ운송 관리자",
        "028 무역ㆍ운송ㆍ생산ㆍ품질 사무원",
        "140 건축ㆍ토목 공학 기술자 및 시험원",
        "522 항공기ㆍ선박ㆍ열차 객실 승무원",
        "621 항공기ㆍ선박ㆍ철도 조종사 및 관제사",
        "622 자동차 운전원",
        "623 물품이동장비 조작원(크레인, 호이스트, 지게차)",
        "624 택배원 및 기타 운송 종사자"
    ],

    "기계ㆍ금속": [
        "016 건설ㆍ채굴ㆍ제조ㆍ생산 관리자",
        "151 기계ㆍ로봇공학 기술자 및 시험원",
        "152 금속ㆍ재료공학 기술자 및 시험원",
        "158 소방ㆍ방재ㆍ산업안전ㆍ비파괴 기술자",
        "612 영업원 및 상품중개인",
        "811 기계장비 설치ㆍ정비원(운송장비 제외)",
        "812 운송장비 정비원",
        "813 금형원 및 공작기계 조작원",
        "815 자동 조립라인ㆍ산업용 로봇 조작원",
        "816 기계 조립원(운송장비 제외)",
        "817 운송장비 조립원",
        "821 금속관련 기계ㆍ설비 조작원",
        "822 판금원 및 제관원",
        "823 단조원 및 주조원",
        "824 용접원",
        "825 도장원 및 도금원",
        "826 비금속제품 생산기계 조작원"
    ],

    "전기ㆍ전자": [
        "153 전기ㆍ전자공학 기술자 및 시험원",
        "612 영업원 및 상품중개인",
        "831 전기공",
        "832 전기ㆍ전자기기 설치ㆍ수리원",
        "833 발전ㆍ배전 장치 조작원",
        "834 전기ㆍ전자 설비 조작원",
        "835 전기ㆍ전자 부품ㆍ제품 생산기계 조작원",
        "836 전기ㆍ전자 부품ㆍ제품 조립원",
        "841 정보통신기기 설치ㆍ수리원",
        "842 방송·통신장비 설치ㆍ정비원"
    ],

    "컴퓨터ㆍ통신": [
        "131 컴퓨터 하드웨어ㆍ통신공학 기술자",
        "132 컴퓨터시스템 전문가",
        "133 소프트웨어 개발자",
        "134 데이터ㆍ네트워크 및 시스템 운영 전문가",
        "135 정보보안 전문가",
        "136 통신ㆍ방송송출 장비 기사",
        "841 정보통신기기 설치ㆍ수리원",
        "842 방송·통신장비 설치ㆍ정비원"
    ],

    "농림ㆍ수산": [
        "016 건설ㆍ채굴ㆍ제조ㆍ생산 관리자",
        "022 경영ㆍ인사 전문가",
        "024 광고ㆍ조사ㆍ상품기획ㆍ행사기획 전문가",
        "025 정부ㆍ공공 행정 사무원",
        "026 경영지원 사무원",
        "121 자연과학 연구원 및 시험원",
        "122 생명과학 연구원 및 시험원",
        "155 에너지ㆍ환경공학 기술자 및 시험원",
        "157 식품공학 기술자 및 시험원",
        "211 대학교수 및 강사",
        "212 학교 교사",
        "214 문리ㆍ기술ㆍ예능 강사",
        "302 수의사",
        "306 의료기사ㆍ치료사ㆍ재활사",
        "612 영업원 및 상품중개인",
        "884 공예원 및 귀금속세공원",
        "901 작물재배 종사자",
        "902 낙농ㆍ사육 종사자",
        "903 임업 종사자",
        "904 어업 종사자",
        "905 농림어업 단순 종사자"
    ],

    "생활과학": [
        "024 광고ㆍ조사ㆍ상품기획ㆍ행사기획 전문가",
        "026 경영지원 사무원",
        "028 무역ㆍ운송ㆍ생산ㆍ품질 사무원",
        "157 식품공학 기술자 및 시험원",
        "231 사회복지사 및 상담사",
        "232 보육교사 및 기타 사회복지 종사자",
        "305 영양사",
        "306 의료기사ㆍ치료사ㆍ재활사",
        "307 보건ㆍ의료 종사자",
        "531 주방장 및 조리사",
        "532 식당 서비스원",
        "550 돌봄 서비스 종사자",
        "612 영업원 및 상품중개인",
        "615 판매 종사자",
        "872 식품 가공 기능원",
        "873 식품 가공 기계 조작원"
    ],

    "간호": [
        "304 간호사",
        "306 의료기사ㆍ치료사ㆍ재활사",
        "307 보건ㆍ의료 종사자",
        "550 돌봄 서비스 종사자"
    ],

    "치료ㆍ보건": [
        "304 간호사",
        "305 영양사",
        "306 의료기사ㆍ치료사ㆍ재활사",
        "307 보건ㆍ의료 종사자",
        "550 돌봄 서비스 종사자"
    ],

    "응용예술": [
        "411 작가ㆍ통번역가",
        "414 창작ㆍ공연 전문가(작가, 연극인 제외)",
        "415 디자이너",
        "416 연극ㆍ영화ㆍ방송 전문가",
        "417 문화ㆍ예술 기획자 및 매니저",
        "420 스포츠ㆍ레크리에이션 종사자",
        "881 인쇄기계ㆍ사진현상기 조작원",
        "884 공예원 및 귀금속세공원",
        "885 악기ㆍ간판 및 기타 제조 종사자"
    ],

    "건축": [
        "016 건설ㆍ채굴ㆍ제조ㆍ생산 관리자",
        "140 건축ㆍ토목 공학 기술자 및 시험원",
        "701 건설구조 기능원",
        "702 건축마감 기능원",
        "703 배관공",
        "704 건설ㆍ채굴기계 운전원",
        "705 기타 건설ㆍ채굴 기능원(채굴포함)",
        "706 건설ㆍ채굴 단순 종사자"
    ],

    "정밀ㆍ에너지": [
        "151 기계ㆍ로봇공학 기술자 및 시험원",
        "153 전기ㆍ전자공학 기술자 및 시험원",
        "155 에너지ㆍ환경공학 기술자 및 시험원",
        "158 소방ㆍ방재ㆍ산업안전ㆍ비파괴 기술자",
        "159 제도사 및 기타 인쇄ㆍ목재 등 공학 기술자 및 시험원",
        "811 기계장비 설치ㆍ정비원(운송장비 제외)",
        "813 금형원 및 공작기계 조작원",
        "831 전기공",
        "833 발전ㆍ배전 장치 조작원",
        "834 전기ㆍ전자 설비 조작원",
        "851 석유ㆍ화학물 가공장치 조작원",
        "853 환경관련 장치 조작원"
    ],

    "디자인": [
        "414 창작ㆍ공연 전문가(작가, 연극인 제외)",
        "415 디자이너",
        "416 연극ㆍ영화ㆍ방송 전문가",
        "417 문화ㆍ예술 기획자 및 매니저",
        "862 패턴사, 재단사 및 재봉사",
        "863 의복 제조원 및 수선원",
        "881 인쇄기계ㆍ사진현상기 조작원",
        "883 가구ㆍ목제품 제조ㆍ수리원",
        "884 공예원 및 귀금속세공원"
    ],

    "무용ㆍ체육": [
        "212 학교 교사",
        "214 문리ㆍ기술ㆍ예능 강사",
        "306 의료기사ㆍ치료사ㆍ재활사",
        "414 창작ㆍ공연 전문가(작가, 연극인 제외)",
        "416 연극ㆍ영화ㆍ방송 전문가",
        "420 스포츠ㆍ레크리에이션 종사자"
    ],

    "음악": [
        "212 학교 교사",
        "214 문리ㆍ기술ㆍ예능 강사",
        "414 창작ㆍ공연 전문가(작가, 연극인 제외)",
        "416 연극ㆍ영화ㆍ방송 전문가",
        "417 문화ㆍ예술 기획자 및 매니저",
        "885 악기ㆍ간판 및 기타 제조 종사자"
    ],

    "토목ㆍ도시": [
        "016 건설ㆍ채굴ㆍ제조ㆍ생산 관리자",
        "140 건축ㆍ토목 공학 기술자 및 시험원",
        "701 건설구조 기능원",
        "702 건축마감 기능원",
        "703 배관공",
        "704 건설ㆍ채굴기계 운전원",
        "705 기타 건설ㆍ채굴 기능원(채굴포함)",
        "706 건설ㆍ채굴 단순 종사자"
    ],

    "언어ㆍ문학": [
        "021 정부ㆍ공공 행정 전문가",
        "024 광고ㆍ조사ㆍ상품기획ㆍ행사기획 전문가",
        "025 정부ㆍ공공 행정 사무원",
        "026 경영지원 사무원",
        "028 무역ㆍ운송ㆍ생산ㆍ품질 사무원",
        "110 인문ㆍ사회과학 연구원",
        "211 대학교수 및 강사",
        "212 학교 교사",
        "214 문리ㆍ기술ㆍ예능 강사",
        "215 장학관 및 기타 교육 종사자",
        "411 작가ㆍ통번역가",
        "412 기자 및 언론 전문가",
        "413 학예사ㆍ사서ㆍ기록물관리사",
        "416 연극ㆍ영화ㆍ방송 전문가",
        "521 여행 서비스원",
        "522 항공기ㆍ선박ㆍ열차 객실 승무원",
        "523 숙박시설 서비스원",
        "612 영업원 및 상품중개인",
        "615 판매 종사자"
    ],

    "소재ㆍ재료": [
        "152 금속ㆍ재료공학 기술자 및 시험원",
        "153 전기ㆍ전자공학 기술자 및 시험원",
        "154 화학공학 기술자 및 시험원",
        "155 에너지ㆍ환경공학 기술자 및 시험원",
        "156 섬유공학 기술자 및 시험원",
        "158 소방ㆍ방재ㆍ산업안전ㆍ비파괴 기술자",
        "821 금속관련 기계ㆍ설비 조작원",
        "822 판금원 및 제관원",
        "823 단조원 및 주조원",
        "824 용접원",
        "825 도장원 및 도금원",
        "826 비금속제품 생산기계 조작원",
        "851 석유ㆍ화학물 가공장치 조작원",
        "852 고무ㆍ플라스틱 및 화학제품 생산기계 조작원 및 조립원",
        "853 환경관련 장치 조작원"
    ],

    "화공": [
        "025 정부ㆍ공공 행정 사무원",
        "028 무역ㆍ운송ㆍ생산ㆍ품질 사무원",
        "154 화학공학 기술자 및 시험원",
        "155 에너지ㆍ환경공학 기술자 및 시험원",
        "157 식품공학 기술자 및 시험원",
        "158 소방ㆍ방재ㆍ산업안전ㆍ비파괴 기술자",
        "612 영업원 및 상품중개인",
        "851 석유ㆍ화학물 가공장치 조작원",
        "852 고무ㆍ플라스틱 및 화학제품 생산기계 조작원 및 조립원",
        "853 환경관련 장치 조작원"
    ],

    "생물ㆍ화학ㆍ환경": [
        "121 자연과학 연구원 및 시험원",
        "122 생명과학 연구원 및 시험원",
        "154 화학공학 기술자 및 시험원",
        "155 에너지ㆍ환경공학 기술자 및 시험원",
        "157 식품공학 기술자 및 시험원",
        "158 소방ㆍ방재ㆍ산업안전ㆍ비파괴 기술자",
        "302 수의사",
        "303 약사 및 한약사",
        "612 영업원 및 상품중개인",
        "852 고무ㆍ플라스틱 및 화학제품 생산기계 조작원 및 조립원",
        "853 환경관련 장치 조작원",
        "901 작물재배 종사자",
        "902 낙농ㆍ사육 종사자"
    ],

    "인문과학": [
        "023 회계ㆍ세무ㆍ감정 전문가",
        "024 광고ㆍ조사ㆍ상품기획ㆍ행사기획 전문가",
        "110 인문ㆍ사회과학 연구원",
        "211 대학교수 및 강사",
        "212 학교 교사",
        "214 문리ㆍ기술ㆍ예능 강사",
        "215 장학관 및 기타 교육 종사자",
        "411 작가ㆍ통번역가",
        "412 기자 및 언론 전문가",
        "413 학예사ㆍ사서ㆍ기록물관리사",
        "416 연극ㆍ영화ㆍ방송 전문가",
        "521 여행 서비스원"
    ],

    "미술ㆍ조형": [
        "413 학예사ㆍ사서ㆍ기록물관리사",
        "414 창작ㆍ공연 전문가(작가, 연극인 제외)",
        "415 디자이너",
        "417 문화ㆍ예술 기획자 및 매니저",
        "881 인쇄기계ㆍ사진현상기 조작원",
        "883 가구ㆍ목제품 제조ㆍ수리원",
        "884 공예원 및 귀금속세공원"
    ],

    "연극ㆍ영화": [
        "411 작가ㆍ통번역가",
        "412 기자 및 언론 전문가",
        "414 창작ㆍ공연 전문가(작가, 연극인 제외)",
        "415 디자이너",
        "416 연극ㆍ영화ㆍ방송 전문가",
        "417 문화ㆍ예술 기획자 및 매니저"
    ],

    "산업": [
        "016 건설ㆍ채굴ㆍ제조ㆍ생산 관리자",
        "024 광고ㆍ조사ㆍ상품기획ㆍ행사기획 전문가",
        "026 경영지원 사무원",
        "028 무역ㆍ운송ㆍ생산ㆍ품질 사무원",
        "132 컴퓨터시스템 전문가",
        "133 소프트웨어 개발자",
        "134 데이터ㆍ네트워크 및 시스템 운영 전문가",
        "151 기계ㆍ로봇공학 기술자 및 시험원",
        "158 소방ㆍ방재ㆍ산업안전ㆍ비파괴 기술자",
        "815 자동 조립라인ㆍ산업용 로봇 조작원",
        "890 제조 단순 종사자"
    ],

    "수학ㆍ물리ㆍ천문ㆍ지리": [
        "024 광고ㆍ조사ㆍ상품기획ㆍ행사기획 전문가",
        "025 정부ㆍ공공 행정 사무원",
        "026 경영지원 사무원",
        "028 무역ㆍ운송ㆍ생산ㆍ품질 사무원",
        "031 금융ㆍ보험 전문가",
        "032 금융ㆍ보험 사무원",
        "121 자연과학 연구원 및 시험원",
        "122 생명과학 연구원 및 시험원",
        "132 컴퓨터시스템 전문가",
        "133 소프트웨어 개발자",
        "134 데이터ㆍ네트워크 및 시스템 운영 전문가",
        "135 정보보안 전문가",
        "136 통신ㆍ방송송출 장비 기사",
        "140 건축ㆍ토목 공학 기술자 및 시험원",
        "151 기계ㆍ로봇공학 기술자 및 시험원",
        "153 전기ㆍ전자공학 기술자 및 시험원",
        "155 에너지ㆍ환경공학 기술자 및 시험원",
        "211 대학교수 및 강사",
        "212 학교 교사",
        "214 문리ㆍ기술ㆍ예능 강사",
        "221 법률 전문가",
        "411 작가ㆍ통번역가",
        "416 연극ㆍ영화ㆍ방송 전문가",
        "612 영업원 및 상품중개인"
    ],

    "법률": [
        "021 정부ㆍ공공 행정 전문가",
        "023 회계ㆍ세무ㆍ감정 전문가",
        "025 정부ㆍ공공 행정 사무원",
        "026 경영지원 사무원",
        "028 무역ㆍ운송ㆍ생산ㆍ품질 사무원",
        "031 금융ㆍ보험 전문가",
        "032 금융ㆍ보험 사무원",
        "110 인문ㆍ사회과학 연구원",
        "135 정보보안 전문가",
        "211 대학교수 및 강사",
        "212 학교 교사",
        "215 장학관 및 기타 교육 종사자",
        "221 법률 전문가",
        "222 법률 사무원",
        "240 경찰관, 소방관 및 교도관",
        "412 기자 및 언론 전문가",
        "611 부동산 컨설턴트 및 중개인"
    ],

    "특수교육": [
        "212 학교 교사",
        "214 문리ㆍ기술ㆍ예능 강사",
        "215 장학관 및 기타 교육 종사자",
        "231 사회복지사 및 상담사",
        "232 보육교사 및 기타 사회복지 종사자",
        "306 의료기사ㆍ치료사ㆍ재활사",
        "550 돌봄 서비스 종사자"
    ],

    "초등교육": [
        "211 대학교수 및 강사",
        "212 학교 교사",
        "214 문리ㆍ기술ㆍ예능 강사",
        "215 장학관 및 기타 교육 종사자"
    ],

    "중등교육": [
        "211 대학교수 및 강사",
        "212 학교 교사",
        "214 문리ㆍ기술ㆍ예능 강사",
        "215 장학관 및 기타 교육 종사자"
    ],

    "교육일반": [
        "211 대학교수 및 강사",
        "212 학교 교사",
        "213 유치원 교사",
        "214 문리ㆍ기술ㆍ예능 강사",
        "215 장학관 및 기타 교육 종사자",
        "231 사회복지사 및 상담사"
    ],

    "의료": [
        "301 의사, 한의사 및 치과의사",
        "302 수의사",
        "303 약사 및 한약사",
        "304 간호사",
        "305 영양사",
        "306 의료기사ㆍ치료사ㆍ재활사",
        "307 보건ㆍ의료 종사자"
    ],

    "약학": [
        "025 정부ㆍ공공 행정 사무원",
        "028 무역ㆍ운송ㆍ생산ㆍ품질 사무원",
        "122 생명과학 연구원 및 시험원",
        "154 화학공학 기술자 및 시험원",
        "155 에너지ㆍ환경공학 기술자 및 시험원",
        "157 식품공학 기술자 및 시험원",
        "303 약사 및 한약사",
        "612 영업원 및 상품중개인",
        "852 고무ㆍ플라스틱 및 화학제품 생산기계 조작원 및 조립원"
    ]
}